class script(object):
    START_GRP_TXT = """<b>ʜᴇʏ {} 
    
ɪ ᴀᴍ ᴀ ᴘᴏᴡᴇʀꜰᴜʟ ᴀᴜᴛᴏꜰɪʟᴛᴇʀ ʙᴏᴛ. ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴍᴇ ɪɴ <a href=t.me/POPKornTimes>ᴍʏ ɢʀᴏᴜᴘ</a> ᴏʀ ʜᴇʀᴇ ɪ ᴄᴀɴ ɢɪᴠᴇ ᴍᴏᴠɪᴇs ᴀɴᴅ sᴇʀɪᴇs ɪɴ ɢʀᴏᴜᴘ ᴏʀ ᴘᴍ, ᴀɴʏᴡʜᴇʀᴇ !! ❣️

🔋 ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙʏ - <a href=https://t.me/Faheem21025492006>FAHEEM</a></b>"""

    START_TXT = """<b>ʜᴇʏ {} 
    
ɪ ᴀᴍ ᴀ ᴘᴏᴡᴇʀꜰᴜʟ ᴀᴜᴛᴏꜰɪʟᴛᴇʀ ʙᴏᴛ. ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴍᴇ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ, ɪ ᴡɪʟʟ ɢɪᴠᴇ ᴍᴏᴠɪᴇs ᴀɴᴅ sᴇʀɪᴇs ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴏʀ ᴘᴍ !! ❣️

🔋 ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙʏ - <a href=https://t.me/MovieZxWorld>𝙈ᴏᴠɪᴇ𝙕 𝙐ɴɪᴠᴇʀꜱᴇ</a></b>"""

    HELP_TXT = """<b>ʜᴇʏ {}
ʜᴇʀᴇ ɪꜱ ᴛʜᴇ ʜᴇʟᴘ ғᴏʀ ᴍʏ ᴄᴏᴍᴍᴀɴᴅs.</b>"""

    ABOUT_TXT = """<b>🤖 ᴍʏ ɴᴀᴍᴇ : smart bot <a href=https://t.me/smart420bot></a>
🤠 ᴏᴡɴᴇʀ : <a href=https://t.me/Faheem21025492006>⋆‌⃝»͢𝐌ꝛ፝֟ 𝆺𝅥 ᭄ঔৣFAHEEM ⍣⃟ ࿐</a>
👨‍💻 ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href=https://t.me/Faheem21025492006>FAHEEM 🚩</a>
📚 ʟɪʙʀᴀʀʏ : <a href=https://docs.pyrogram.org/>ᴘʏʀᴏɢʀᴀᴍ</a>
📝 ʟᴀɴɢᴜᴀɢᴇ : <a href=https://www.python.org/download/releases/3.0/>ᴘʏᴛʜᴏɴ 3</a>
♻️ ᴅᴀᴛᴀʙᴀsᴇ : <a href=https://www.mongodb.com/>ᴍᴏɴɢᴏ ᴅʙ</a>
📡 ʙᴏᴛ sᴇʀᴠᴇʀ : <a href=https://oracle.com/>ᴏʀᴀᴄʟᴇ ᴠᴘs</a>
🥶 ʙᴜɪʟᴅ sᴛᴀᴛᴜs : ᴠ1.0.0 [sᴛᴀʙʟᴇ​]</b>"""

    OWNER_INFO = """<b>┏━•❃𓊈𒆜Oᴡɴᴇʀ Dᴇᴛᴀɪʟꜱ𒆜𓊉❃•━┓   
 ◈ ᴛɢ ɴᴀᴍᴇ : 『ᴄᴀʟʟ ᴍᴇ Faheem ansari..』🚩
 ◈ ɴɪᴄᴋɴᴀᴍᴇ : Faheem
 ◈ ᴜꜱᴇʀɴᴀᴍᴇ : <a href=https://t.me/Faheem21025492006>『...Faheem』</a>🚩
 ◈ ᴘᴇʀᴍᴀɴᴇɴᴛ ᴅᴍ ʟɪɴᴋ : <a href=https://t.me/Faheem21025492006>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>
 ◈ ᴋɴᴏ ᴍᴏʀᴇ ᴀʙᴛ ᴍᴇ :<a href=https://t.me/Faheem21025492006>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>
‿︵‿︵‿︵‿୨❤୧‿︵‿︵‿︵‿</b>
"""
     
    ROULS_TXT = """<b>🔋 𝗚𝗥𝗢𝗨𝗣 𝗥𝗨𝗟𝗘𝗦 🔋

‣ Sᴇᴀʀᴄʜ Mᴏᴠɪᴇ Wɪᴛʜ Cᴏʀʀᴇᴄᴛ Sᴘᴇʟʟɪɴɢ :
› ᴀᴠᴀᴛᴀʀ 2009 ✔
› ᴀᴠᴀᴛᴀʀ ʜɪɴᴅɪ ✔
› ᴀᴠᴀᴛᴀʀ ᴍᴏᴠɪᴇ ✘
› ᴀᴠᴀᴛᴀʀ ʜɪɴᴅɪ ᴅᴜʙʙᴇᴅ..✘

‣ Sᴇᴀʀᴄʜ Wᴇʙ Sᴇʀɪᴇs Iɴ ᴛʜɪs Fᴏʀᴍᴀᴛ : 
› ᴠɪᴋɪɴɢs S01 ✔
› ᴠɪᴋɪɴɢs S01E01 ✔
› ᴠɪᴋɪɴɢs S01 ʜɪɴᴅɪ ✔
› ᴠɪᴋɪɴɢs S01 ʜɪɴᴅɪ ᴅᴜʙʙ. ✘
› ᴠɪᴋɪɴɢs sᴇᴀsᴏɴ 1 ✘
› ᴠɪᴋɪɴɢs ᴡᴇʙ sᴇʀɪᴇs ✘

‣ ᴅᴏɴ'ᴛ ᴅᴏ ᴀɴʏ sᴇʟғ ᴘʀᴏᴍᴏᴛɪᴏɴ.

‣ ᴅᴏɴ'ᴛ sᴇɴᴅ ᴀɴʏ ᴋɪɴᴅ ᴏғ ᴍᴇᴅɪᴀ !!

‣ ᴅᴏɴ'ᴛ ʀᴇǫᴜᴇsᴛ ᴀɴʏᴛʜɪɴɢ ᴏᴛʜᴇʀ ᴛʜᴀɴ ᴍᴏᴠɪᴇ, sᴇʀɪᴇs ᴀɴᴅ ᴀɴɪᴍᴇs..

🪄 ɴᴏᴛᴇ :- 𝖠ʟʟ ᴍᴇ𝗌𝗌ᴀɢᴇ𝗌 ᴡɪʟʟ ʙᴇ ᴀᴜᴛᴏ-ᴅᴇʟᴇᴛᴇᴅ ᴀғᴛᴇʀ 𝟷𝟶 ᴍɪɴᴜᴛᴇ𝗌 ᴛᴏ ᴀᴠᴏɪᴅ ᴄᴏᴘʏʀɪɢʜᴛ ɪ𝗌𝗌ᴜᴇ𝗌. ꜱᴏ ᴍᴀᴋᴇ ꜱᴜʀᴇ ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴛʜᴇᴍ ꜱᴏᴍᴇᴡʜᴇʀᴇ ᴇʟꜱᴇ ʙᴇғᴏʀᴇ ᴛʜᴇʏ ɢᴇᴛ ᴅᴇʟᴇᴛᴇᴅ⚡</b>"""

    MORE_TXT = """<b>Yᴏᴜ Cᴀɴ Tʀʏ Aʟʟ Tʜᴇsᴇ Cᴏᴏʟ Fᴇᴀᴛᴜʀᴇs Fʀᴏᴍ Bᴇʟᴏᴡ Oᴘᴛɪᴏɴs..!!!</b>"""

    SOURCE_TXT = """
<b>ɴᴏᴛᴇ :

⚠️ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ɴᴏᴛ ᴀɴ ᴏᴘᴇɴ-ꜱᴏᴜʀᴄᴇ ᴘʀᴏᴊᴇᴄᴛ

◆ ꜱᴏᴜʀᴄᴇ ᴄᴏᴅᴇ :<a href=https://t.me/itzrenierb> ʜᴇʀᴇ </a>
◆ ɪғ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʙᴜʏ ʏᴏᴜʀꜱᴇʟғ ᴛʜᴇ ꜱᴀᴍᴇ ʙᴏᴛ ʟɪᴋᴇ ᴛʜɪꜱ ᴏʀ ᴡᴀɴᴛ ɪᴛ'ꜱ ꜱᴏᴜʀᴄᴇ ᴄᴏᴅᴇ, ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ..!

◆ ᴅᴇᴠ : <a href=https://t.me/Faheem21025492006>⋆‌⃝»͢𝐌ꝛ፝֟ 𝆺𝅥 ᭄ঔৣFaheem ⍣⃟ ࿐</a></b>
"""

    MANUELFILTER_TXT = """ʜᴇʟᴘ: <b>ꜰɪʟᴛᴇʀꜱ</b>
- ꜰɪʟᴛᴇʀ ɪꜱ ᴀ ꜰᴇᴀᴛᴜʀᴇ ᴡʜᴇʀᴇ ᴜꜱᴇʀꜱ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟɪᴇꜱ ꜰᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ ɪ ᴡɪʟʟ ʀᴇꜱᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪꜱ ꜰᴏᴜɴᴅ ɪɴ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ

<b>ɴᴏᴛᴇ:</b>

1. ᴛʜɪꜱ ʙᴏᴛ ꜱʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘʀɪᴠɪʟᴇɢᴇ.
2. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ.
3. ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ ʜᴀᴠᴇ ᴀ ʟɪᴍɪᴛ ᴏꜰ 64 ᴄʜᴀʀᴀᴄᴛᴇʀꜱ.

<b>ᴄᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:</b>

• /filter - <code>ᴀᴅᴅ ᴀ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</code>
• /filters - <code>ʟɪꜱᴛ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴛᴇʀꜱ ᴏꜰ ᴀ ᴄʜᴀᴛ</code>
• /del - <code>ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</code>
• /delall - <code>ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ (ᴄʜᴀᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)</code>"""

    BUTTON_TXT = """ʜᴇʟᴘ: <b>ʙᴜᴛᴛᴏɴꜱ</b>
ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴏᴛʜ ᴜʀʟ ᴀɴᴅ ᴀʟᴇʀᴛ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴꜱ.

<b>ɴᴏᴛᴇ:</b>

1. ᴛᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛ ᴀʟʟᴏᴡꜱ ʏᴏᴜ ᴛᴏ ꜱᴇɴᴅ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ, ꜱᴏ ᴄᴏɴᴛᴇɴᴛ ɪꜱ ᴍᴀɴᴅᴀᴛᴏʀʏ.
2. ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.
3. ʙᴜᴛᴛᴏɴꜱ ꜱʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀꜱᴇᴅ ᴀꜱ ᴍᴀʀᴋᴅᴏᴡɴ ꜰᴏʀᴍᴀᴛ

<b>ᴜʀʟ ʙᴜᴛᴛᴏɴꜱ:</b>

<code>[Button Text](buttonurl:https://t.me/Faheem21025492006)</code>

<b>ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ:</b>

<code>[Button Text](buttonalert:ᴛʜɪꜱ ɪꜱ ᴀɴ ᴀʟᴇʀᴛ ᴍᴇꜱꜱᴀɢᴇ)</code>"""

    FILE_STORE_TXT = """
<b>Fɪʟᴇ sᴛᴏʀᴇ ɪs ᴛʜᴇ ғᴇᴀᴛᴜʀᴇ ᴡʜɪᴄʜ ᴡɪʟʟ ᴄʀᴇᴀᴛᴇ ᴀ sʜᴀʀᴇᴀʙʟᴇ ʟɪɴᴋ ᴏғ ᴀ sɪɴɢʟᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</b>

<b>ᴄᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:</b>

• /batch - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ʙᴀᴛᴄʜ ʟɪɴᴋ ᴏғ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</code>
• /link - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ sɪɴɢʟᴇ ғɪʟᴇ sᴛᴏʀᴇ ʟɪɴᴋ.</code>
• /pbatch - <code>Jᴜsᴛ ʟɪᴋᴇ /batch, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇs ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴs.</code>
• /plink - <code>Jᴜsᴛ ʟɪᴋᴇ /link, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇ ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴ.</code>"""

    TGRAPH_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ᴛᴇʟᴇɢʀᴀᴘʜ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ᴛᴇʟᴇɢʀᴀᴘʜ ʟɪɴᴋ ɢᴇɴᴇʀᴀᴛᴏʀ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /telegraph or /tgraph - ꜱᴇɴᴅ ᴍᴇ ᴘʜᴏᴛᴏ ᴏʀ ᴠɪᴅᴇᴏ ᴜɴᴅᴇʀ(𝟻ᴍʙ) ᴀɴᴅ ʀᴇᴘʟʏ ᴡɪᴛʜ ᴄᴏᴍᴍᴀɴᴅ, ɪ'ʟʟ ɢᴇɴᴇʀᴀᴛᴇ ɪᴛ'ꜱ ᴛᴇʟᴇɢʀᴀᴘʜ ʟɪɴᴋ </b>"""
    
    STICKER_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ꜱᴛɪᴄᴋᴇʀ_ɪᴅ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ꜱᴛɪᴄᴋᴇʀ-ɪᴅ ɢᴇɴᴇʀᴀᴛᴏʀ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /stickerid - ʀᴇᴘʟʏ ᴛᴏ ᴀɴʏ ꜱᴛɪᴄᴋᴇʀ </b>"""
    
    CRBN_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ᴄᴀʀʙᴏɴ ɪᴍᴀɢᴇ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ᴄᴀʀʙᴏɴ ɪᴍᴀɢᴇ ɢᴇɴᴇʀᴀᴛᴏʀ ғʀᴏᴍ ᴛᴇxᴛ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /carbon - Rᴇᴘʟʏ Wɪᴛʜ Tᴇxᴛ Tᴏ Gᴇᴛ Cᴀʀʙᴏɴᴀᴛᴇᴅ Iᴍᴀɢᴇ </b>"""
    
    CONTRY_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ᴄᴏᴜɴᴛʀʏ ɪɴғᴏ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ᴄᴏᴜɴᴛʀʏ ɪɴғᴏ ᴇxᴛʀᴀᴄᴛᴏʀ ғʀᴏᴍ ᴡᴇʙ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /country [𝖼𝗈𝗎𝗇𝗍𝗋𝗒 𝗇𝖺𝗆𝖾] 
ᴇxᴀᴍᴘʟᴇ :- `/country India`</b>"""
    
    TXT_TO_SPEECH_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ᴛᴇxᴛ-ᴛᴏ-ꜱᴘᴇᴇᴄʜ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ᴛᴇxᴛ-ᴛᴏ-ꜱᴘᴇᴇᴄʜ Cᴏɴᴠᴇʀᴛᴇʀ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /tts [ᴛᴇxᴛ] - Cᴏɴᴠᴇʀᴛ Tᴇxᴛ Tᴏ Sᴘᴇᴇᴄʜ </b>"""
    
    FNT_GEN_TXT = """<b><u>🔮 ʜᴇʟᴘ: ◉ ғᴏɴᴛ ɢᴇɴᴇʀᴀᴛᴏʀ ◉</u>
    ➣<u>Uꜱᴀɢᴇ</u> : ғᴀɴᴄʏ ғᴏɴᴛ ɢᴇɴᴇʀᴀᴛᴏʀ

    ⭕ 𝙃𝙤𝙬 𝙏𝙤 𝙐𝙨𝙚 ⋙
    • /font [ᴛᴇxᴛ] - Tᴏ Cʜᴀɴɢᴇ Yᴏᴜʀ Tᴇxᴛ Fᴏɴᴛs Tᴏ Fᴀɴᴄʏ Fᴏɴᴛ </b>"""

    AUTOFILTER_TXT = """ʜᴇʟᴘ: <b>ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ</b>
    
<b>ɴᴏᴛᴇ: Fɪʟᴇ Iɴᴅᴇx</b>

1. ᴍᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏꜰ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪꜰ ɪᴛ'ꜱ ᴘʀɪᴠᴀᴛᴇ.
2. ᴍᴀᴋᴇ ꜱᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇꜱ ɴᴏᴛ ᴄᴏɴᴛᴀɪɴꜱ ᴄᴀᴍʀɪᴘꜱ, ᴘᴏʀɴ ᴀɴᴅ ꜰᴀᴋᴇ ꜰɪʟᴇꜱ.
3. ꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀꜱᴛ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴍᴇ ᴡɪᴛʜ Qᴜᴏᴛᴇꜱ. ɪ'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ.

<b>Nᴏᴛᴇ: AᴜᴛᴏFɪʟᴛᴇʀ</b>

1. Aᴅᴅ ᴛʜᴇ ʙᴏᴛ ᴀs ᴀᴅᴍɪɴ ᴏɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
2. Usᴇ /connect ᴀɴᴅ ᴄᴏɴɴᴇᴄᴛ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴛʜᴇ ʙᴏᴛ.
3. Usᴇ /settings ᴏɴ ʙᴏᴛ's PM ᴀɴᴅ ᴛᴜʀɴ ᴏɴ AᴜᴛᴏFɪʟᴛᴇʀ ᴏɴ ᴛʜᴇ sᴇᴛᴛɪɴɢs ᴍᴇɴᴜ."""

    PREMIUM_TXT = """<b><u>Pʀᴇᴍɪᴜᴍ Fᴇᴀᴛᴜʀᴇs</u> 🎁                      
○ ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪғʏ
○ ᴅɪʀᴇᴄᴛ ғɪʟᴇs   
○ ᴀᴅ-ғʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ 
○ ʜɪɢʜ-sᴘᴇᴇᴅ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋ                         
○ ᴍᴜʟᴛɪ-ᴘʟᴀʏᴇʀ sᴛʀᴇᴀᴍɪɴɢ ʟɪɴᴋs                           
○ ᴜɴʟɪᴍɪᴛᴇᴅ ᴍᴏᴠɪᴇs & sᴇʀɪᴇs                                                                         
○ ꜰᴜʟʟ ᴀᴅᴍɪɴ sᴜᴘᴘᴏʀᴛ                              
○ ʀᴇǫᴜᴇsᴛ ᴡɪʟʟ ʙᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ɪɴ 1ʜ ɪꜰ ᴀᴠᴀɪʟᴀʙʟᴇ   

➥ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴀᴄᴛɪᴠᴇ ᴘʟᴀɴ /myplan

‼️ ᴄʟɪᴄᴋ ᴏɴ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴ ᴛᴏ ᴄʜᴇᴄᴋ ᴀʟʟ ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʟᴀɴs & ɪᴛ's ᴘʀɪᴄᴇs</b>"""

    PLANSPRICES_TXT = """<b><u>ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴇɴᴛᴇʀ ᴜᴘɪ ɪᴅ & ᴘʟᴀɴ ᴀᴍᴏᴜɴᴛ ᴍᴀɴᴜᴀʟʟʏ, ᴊᴜsᴛ ᴄʟɪᴄᴋ ᴏɴ ʙᴇʟᴏᴡ ᴘʟᴀɴ ʙᴜᴛᴛᴏɴ & ᴘᴀʏ ᴘʀᴇᴍɪᴜᴍ ғᴇᴇs ᴜsɪɴɢ ᴀɴʏ ᴜᴘɪ ᴀᴘᴘ ɪɴ ᴊᴜsᴛ sᴏᴍᴇ ᴄʟɪᴄᴋs.</u>

ᴜᴘɪ ɪᴅ ➩ <spoil>ᴅᴍ faheem786123@paytm [ɪғ ʀᴇǫᴜɪʀᴇᴅ]</spoil>
 
‼️ <u>ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ</u> & ᴘʟᴇᴀsᴇ ɢɪᴠᴇ ᴜs sᴏᴍᴇ ᴛɪᴍᴇ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴛʜᴇ ᴘʀᴇᴍɪᴜᴍ ʟɪsᴛ

💢 ᴘʟᴀɴ ᴘʀɪᴄᴇ ᴍᴀʏ ᴀɴᴅ ᴡɪʟʟ ɪɴᴄʀᴇᴀsᴇ ɪɴ ғᴜᴛᴜʀᴇ.</b>"""

    EARNPREM_TXT = """<b><u>ɴᴏ ᴍᴏɴᴇʏ ? ɴᴏ ᴡᴏʀʀɪᴇs !!</u>
    
➥ <u>ʜᴇʀᴇ, ᴏɴ <a href=t.me/movieriqvestatoz>ᴍᴏᴠɪᴇᴢ ᴛᴏɴɪɢʜᴛ</a></u> ᴡᴇ ʙᴇʟɪᴇᴠᴇ ᴛʜᴀᴛ ᴇɴᴛᴇʀᴛᴀɪɴᴍᴇɴᴛ sʜᴏᴜʟᴅ ʙᴇ ғʀᴇᴇ ᴀɴᴅ ᴇᴠᴇʀʏᴏɴᴇ ᴅᴇsᴇʀᴠᴇs ᴛʜᴇ ʀɪɢʜᴛ ᴛᴏ ᴡᴀᴛᴄʜ ʟᴀᴛᴇsᴛ ᴍᴏᴠɪᴇs/sᴇʀɪᴇs ᴀɴᴅ ʙɪɴɢᴇ ғʀᴇᴇ ᴏғ ᴄᴏsᴛ sᴇᴀᴍʟᴇssʟʏ ᴀɴᴅ ᴡɪᴛʜ ϙᴜᴀʟɪᴛʏ !! sᴏ ᴡᴇ ʜᴀᴠᴇ ɪɴᴛʀᴏᴅᴜᴄᴇᴅ ᴀᴅᴠᴀɴᴄᴇᴅ "ʀᴇғᴇʀ & ᴇᴀʀɴ" sʏsᴛᴇᴍ ɪɴ ᴏᴜʀ ʙᴏᴛ ᴡʜɪᴄʜ ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴛᴏ ɢᴇᴛ ᴘʀᴇᴍɪᴜᴍ, ᴄᴏᴍᴘʟᴇᴛᴇʟʏ ғʀᴇᴇ ᴏғ ᴄᴏsᴛ. sᴀʏ ʙʏʏ ᴛᴏ ᴇxᴘᴇɴsɪᴠᴇ sᴜʙsᴄʀɪᴘᴛɪᴏɴs ᴏғ ɴᴇᴛғʟɪx

➥ ᴊᴜsᴛ sᴇɴᴅ /refer ᴛᴏ ɢᴇᴛ ᴍᴏʀᴇ ᴅᴇᴛᴀɪʟs ᴀɴᴅ ʏᴏᴜʀ sᴘᴇᴄɪᴀʟ ʀᴇғᴇʀ ʟɪɴᴋ ғʀᴏᴍ ᴡʜɪᴄʜ ʏᴏᴜ ᴄᴀɴ ɪɴᴠɪᴛᴇ ʏᴏᴜʀ ғʀɪᴇɴᴅs ᴀɴᴅ ᴇᴀʀɴ ᴄᴏɪɴs, ᴀɴᴅ ᴏɴ 10 sᴜᴄᴄᴇssғᴜʟ ʀᴇғᴇʀs (i.e. 100 ᴘᴏɪɴs), ʏᴏᴜ ᴄᴀɴ ʀᴇᴅᴇᴇᴍ ʏᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ sᴜʙsᴄʀɪᴘᴛɪᴏɴ ғᴏʀ ᴀ ᴍᴏɴᴛʜ.</b>"""

    CONNECTION_TXT = """ʜᴇʟᴘ: <b>ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ</b>
    
- ᴜꜱᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ ᴘᴍ ꜰᴏʀ ᴍᴀɴᴀɢɪɴɢ ꜰɪʟᴛᴇʀꜱ 
- ɪᴛ ʜᴇʟᴘꜱ ᴛᴏ ᴀᴠᴏɪᴅ ꜱᴘᴀᴍᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘꜱ.

<b>ɴᴏᴛᴇ:</b>

1. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
2. ꜱᴇɴᴅ <code>/ᴄᴏɴɴᴇᴄᴛ</code> ꜰᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ᴘᴍ

<b>ᴄᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:</b>

• /connect  - <code>ᴄᴏɴɴᴇᴄᴛ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴄʜᴀᴛ ᴛᴏ ʏᴏᴜʀ ᴘᴍ</code>
• /disconnect  - <code>ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ</code>
• /connections - <code>ʟɪꜱᴛ ᴀʟʟ ʏᴏᴜʀ ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ</code>"""

    CHANNELS_MODULE_TXT = """<b>🎯✨ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ 𝙈ᴏᴠɪᴇ𝙕 world❣

⚡️🍬ᴊᴏɪɴ ᴏᴜʀ ᴍᴏᴠɪᴇꜱ ᴄʜᴀɴɴᴇʟꜱ 🦋✨

<a href=https://t.me/iPapkornbetabots>🔰✥ ▷ ᴍᴀɪɴ ᴄʜᴀɴɴᴇʟ ◁</a>

<a href=https://t.me/faheemkhatri7861>🔰✥ ▷packup channel◁</a>

<a href=https://t.me/faheem786786>🔰✥ ▷ ᴍᴏᴠɪᴇ update channel◁</a>

🦋 ᴍʏ ʙᴇsᴛ ғʀɪᴇɴᴅ : <a href=tg://settings>ᴛʜɪs ᴘᴇʀsᴏɴ 🙌</a></b>"""

    EXTRA_TXT = """ʜᴇʟᴘ: Exᴛʀᴀ Mᴏᴅᴜʟᴇs

<b>ɴᴏᴛᴇ:</b>

ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ᴇxᴛʀᴀ ꜰᴇᴀᴛᴜʀᴇꜱ ᴏꜰ ᴛʜɪꜱ ʙᴏᴛ

<b>ᴄᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:</b>

• /id - <code>ɢᴇᴛ ɪᴅ ᴏꜰ ᴀ ꜱᴘᴇᴄɪꜰɪᴇᴅ ᴜꜱᴇʀ.</code>
• /info  - <code>ɢᴇᴛ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜꜱᴇʀ.</code>
• /imdb  - <code>ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ɪᴍᴅʙ ꜱᴏᴜʀᴄᴇ.</code>
• /search  - <code>ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ᴠᴀʀɪᴏᴜꜱ ꜱᴏᴜʀᴄᴇꜱ.</code>"""

    ADMIN_TXT = """ʜᴇʟᴘ: Aᴅᴍɪɴ Mᴏᴅs

<b>ɴᴏᴛᴇ:</b>

ɴᴏᴛᴇ: Tʜɪs Mᴏᴅᴜʟᴇ Oɴʟʏ Wᴏʀᴋs Fᴏʀ Mʏ Aᴅᴍɪɴs

<b>ᴄᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:</b>

• /logs - <code>ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʀᴇᴄᴇɴᴛ ᴇʀʀᴏʀꜱ</code>
• /stats - <code>ᴛᴏ ɢᴇᴛ ꜱᴛᴀᴛᴜꜱ ᴏꜰ ꜰɪʟᴇꜱ ɪɴ ᴅʙ. [Tʜɪs Cᴏᴍᴍᴀɴᴅ Cᴀɴ Bᴇ Usᴇᴅ Bʏ Aɴʏᴏɴᴇ]</code>
• /delete - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴇ ꜰʀᴏᴍ ᴅʙ.</code>
• /users - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴜꜱᴇʀꜱ ᴀɴᴅ ɪᴅꜱ.</code>
• /chats - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴄʜᴀᴛꜱ ᴀɴᴅ ɪᴅꜱ</code>
• /leave  - <code>ᴛᴏ ʟᴇᴀᴠᴇ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ.</code>
• /disable  -  <code>ᴛᴏ ᴅɪꜱᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.</code>
• /ban  - <code>ᴛᴏ ʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /unban  - <code>ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ.</code>
• /channel - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴛᴏᴛᴀʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ</code>
• /broadcast - <code>ᴛᴏ ʙʀᴏᴀᴅᴄᴀꜱᴛ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜꜱᴇʀꜱ</code>
• /grp_broadcast - <code>Tᴏ ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘs.</code>
• /gfilter - <code>ᴛᴏ ᴀᴅᴅ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs</code>
• /gfilters - <code>ᴛᴏ ᴠɪᴇᴡ ʟɪsᴛ ᴏғ ᴀʟʟ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs</code>
• /delg - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ sᴘᴇᴄɪғɪᴄ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ</code>
• /request - <code>Tᴏ sᴇɴᴅ ᴀ Mᴏᴠɪᴇ/Sᴇʀɪᴇs ʀᴇᴏ̨ᴜᴇsᴛ ᴛᴏ ʙᴏᴛ ᴀᴅᴍɪɴs. Oɴʟʏ ᴡᴏʀᴋs ᴏɴ sᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ. [Tʜɪs Cᴏᴍᴍᴀɴᴅ Cᴀɴ Bᴇ Usᴇᴅ Bʏ Aɴʏᴏɴᴇ]</code>
• /delallg - <code>Tᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ Gғɪʟᴛᴇʀs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ's ᴅᴀᴛᴀʙᴀsᴇ.</code>
• /deletefiles - <code>Tᴏ ᴅᴇʟᴇᴛᴇ CᴀᴍRɪᴘ ᴀɴᴅ PʀᴇDVD Fɪʟᴇs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ's ᴅᴀᴛᴀʙᴀsᴇ.</code>"""

    SPPRT_TXT = """<b> 🦋 ᴄʜᴀɴɴᴇʟs & ɢʀᴏᴜᴘs ᴍᴏᴅᴜʟᴇ 🦋

» ᴄᴏᴍᴘʟᴇᴛᴇ ᴍᴏᴠɪᴇ ʀᴇǫᴜᴇsᴛɪɴɢ ɢʀᴏᴜᴘ.
» ᴀʟʟ ʟᴀɴɢᴜᴀɢᴇs ᴍᴏᴠɪᴇs & ꜱᴇʀɪᴇs.
» ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ.
» ʙᴏᴛ ᴜᴘᴅᴀᴛᴇs ᴄʜᴀɴɴᴇʟ.</b>"""
    
    STATUS_TXT = """<b>
╭━━━╮╭━━━━╮╭━━━╮╭━━━━╮╭━━━╮
┃╭━╮┃┃╭╮╭╮┃┃╭━╮┃┃╭╮╭╮┃┃╭━╮┃
┃╰━━╮╰╯┃┃╰╯┃┃╱┃┃╰╯┃┃╰╯┃╰━━╮
╰━━╮┃╱╱┃┃╱╱┃╰━╯┃╱╱┃┃╱╱╰━━╮┃
┃╰━╯┃╱╱┃┃╱╱┃╭━╮┃╱╱┃┃╱╱┃╰━╯┃
╰━━━╯╱╱╰╯╱╱╰╯╱╰╯╱╱╰╯╱╱╰━━━╯
📑 ғɪʟᴇs sᴀᴠᴇᴅ: <code>{}</code>
👩🏻‍💻 ᴜsᴇʀs: <code>{}</code>
👥 ɢʀᴏᴜᴘs: <code>{}</code>
🗂️ ᴏᴄᴄᴜᴘɪᴇᴅ: <code>{}</code>
🗄️ ғʀᴇᴇ sᴛᴏʀᴀɢᴇ: <code>{}</code></b>"""

    LOG_TEXT_G = """#NewGroup
Gʀᴏᴜᴘ = {}(<code>{}</code>)
Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs = <code>{}</code>
Aᴅᴅᴇᴅ Bʏ - {}"""

    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Nᴀᴍᴇ - {}"""

    ALRT_TXT = """ʜᴇʟʟᴏ {},
ᴛʜɪꜱ ɪꜱ ɴᴏᴛ ʏᴏᴜʀ ᴍᴏᴠɪᴇ ʀᴇQᴜᴇꜱᴛ,
ʀᴇQᴜᴇꜱᴛ ʏᴏᴜʀ'ꜱ..."""

    OLD_ALRT_TXT = """ʜᴇʏ {},
ʏᴏᴜ ᴀʀᴇ ᴜꜱɪɴɢ ᴏɴᴇ ᴏꜰ ᴍʏ ᴏʟᴅ ᴍᴇꜱꜱᴀɢᴇꜱ, 
ᴘʟᴇᴀꜱᴇ ꜱᴇɴᴅ ᴛʜᴇ ʀᴇQᴜᴇꜱᴛ ᴀɢᴀɪɴ."""

    CUDNT_FND = """ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}
ᴅɪᴅ ʏᴏᴜ ᴍᴇᴀɴ ᴀɴʏ ᴏɴᴇ ᴏꜰ ᴛʜᴇꜱᴇ?"""

    I_CUDNT = """<b>ᴛʜɪs ᴍᴏᴠɪᴇ ɪs ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ.
ɢᴇᴛ ᴛʜɪs ᴍᴏᴠɪᴇ ʙʏ ᴊᴏɪɴɪɴɢ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ ⇊
    
<a href=https://t.me/+MFEaJVPhFDplZDkx>🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁</a></b>"""

    I_CUD_NT = """<b>ᴛʜɪs ᴍᴏᴠɪᴇ ɪs ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ.
ɢᴇᴛ ᴛʜɪs ᴍᴏᴠɪᴇ ʙʏ ᴊᴏɪɴɪɴɢ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ ⇊
    
<a href=https://t.me/+MFEaJVPhFDplZDkx>🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁</a></b>"""

    MVE_NT_FND = """<b>ᴛʜɪs ᴍᴏᴠɪᴇ ɪs ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ.
ɢᴇᴛ ᴛʜɪs ᴍᴏᴠɪᴇ ʙʏ ᴊᴏɪɴɪɴɢ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ ⇊
    
<a href=https://t.me/+MFEaJVPhFDplZDkx>🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁
🎁 ᴘʀᴇᴍɪᴜᴍ ᴄʜᴀɴɴᴇʟ 🎁</a></b>"""

    TOP_ALRT_MSG = """♻️ 𝗖𝗵𝗲𝗰𝗸𝗶𝗻𝗴 𝗙𝗼𝗿 𝗠𝗼𝘃𝗶𝗲 𝗜𝗻 𝗗𝗮𝘁𝗮𝗯𝗮𝘀𝗲..♻️"""

    MELCOW_ENG = """<b>ʜᴇʟʟᴏ {} 😍, ᴀɴᴅ ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ {} ɢʀᴏᴜᴘ ❤️</b>"""

    REQINFO = """
⚠ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ⚠

ᴀꜰᴛᴇʀ 5 ᴍɪɴᴜᴛᴇꜱ ᴛʜɪꜱ ᴍᴇꜱꜱᴀɢᴇ ᴡɪʟʟ ʙᴇ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴅᴇʟᴇᴛᴇᴅ

ɪꜰ ʏᴏᴜ ᴅᴏ ɴᴏᴛ ꜱᴇᴇ ᴛʜᴇ ʀᴇǫᴜᴇsᴛᴇᴅ ᴍᴏᴠɪᴇ / sᴇʀɪᴇs ꜰɪʟᴇ, ʟᴏᴏᴋ ᴀᴛ ᴛʜᴇ ɴᴇxᴛ ᴘᴀɢᴇ"""

    SINFO = """
🫣 Null 💀"""

    NORSLTS = """ 
★ #𝗡𝗼𝗥𝗲𝘀𝘂𝗹𝘁𝘀 ★

𝗜𝗗 <b>: {}</b>

𝗡𝗮𝗺𝗲 <b>: {}</b>

𝗠𝗲𝘀𝘀𝗮𝗴𝗲 <b>: {}</b>"""

    CAPTION = """<b>‼️ <a href="https://t.me/iPapkornbetabots">{file_name}</a>

© <a href="https://t.me/iPapkornbetabots">𝙈ᴏᴠɪᴇ𝙕 world™</a></b>""" 

    IMDB_TEMPLATE_TXT = """
<b>🎬 ᴛɪᴛʟᴇ : <a href={url}>{title}</a>

📂 ᴛᴏᴛᴀʟ ғɪʟᴇꜱ : {total_results}

⏰ ʀᴇsᴜʟᴛ sʜᴏᴡɴ ɪɴ : {remaining_seconds} <i>seconds</i> 🔥

📝 ʀᴇϙᴜᴇsᴛᴇᴅ ʙʏ : {message.from_user.mention}

⚜️ ᴘᴏᴡᴇʀᴇᴅ ʙʏ : <a href="t.me/iPapkornbetabots">𝙈ᴏᴠɪᴇ𝙕 world</a></b>"""
    
    ALL_FILTERS = """
<b>Hᴇʏ {}, Tʜᴇsᴇ ᴀʀᴇ ᴍʏ ᴛʜʀᴇᴇ ᴛʏᴘᴇs ᴏғ ғɪʟᴛᴇʀs.</b>"""
    
    GFILTER_TXT = """
<b>Wᴇʟᴄᴏᴍᴇ ᴛᴏ Gʟᴏʙᴀʟ Fɪʟᴛᴇʀs. Gʟᴏʙᴀʟ Fɪʟᴛᴇʀs ᴀʀᴇ ᴛʜᴇ ғɪʟᴛᴇʀs sᴇᴛ ʙʏ ʙᴏᴛ ᴀᴅᴍɪɴs ᴡʜɪᴄʜ ᴡɪʟʟ ᴡᴏʀᴋ ᴏɴ ᴀʟʟ ɢʀᴏᴜᴘs.</b>
    
Aᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:
• /gfilter - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</code>
• /gfilters - <code>Tᴏ ᴠɪᴇᴡ ᴀʟʟ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs.</code>
• /delg - <code>Tᴏ ᴅᴇʟᴇᴛᴇ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</code>
• /delallg - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀꜱ.</code>"""
    
    FILE_STORE_TXT = """
<b>Fɪʟᴇ sᴛᴏʀᴇ ɪs ᴛʜᴇ ғᴇᴀᴛᴜʀᴇ ᴡʜɪᴄʜ ᴡɪʟʟ ᴄʀᴇᴀᴛᴇ ᴀ sʜᴀʀᴇᴀʙʟᴇ ʟɪɴᴋ ᴏғ ᴀ sɪɴɢʟᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</b>

Aᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:
• /batch - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ʙᴀᴛᴄʜ ʟɪɴᴋ ᴏғ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</code>
• /link - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ sɪɴɢʟᴇ ғɪʟᴇ sᴛᴏʀᴇ ʟɪɴᴋ.</code>
• /pbatch - <code>Jᴜsᴛ ʟɪᴋᴇ /batch, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇs ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴs.</code>
• /plink - <code>Jᴜsᴛ ʟɪᴋᴇ /link, ʙᴜᴛ ᴛʜᴇ ғɪʟᴇ ᴡɪʟʟ ʙᴇ sᴇɴᴅ ᴡɪᴛʜ ғᴏʀᴡᴀʀᴅ ʀᴇsᴛʀɪᴄᴛɪᴏɴ.</code>"""
 
    RESTART_TXT = """
<b>Bᴏᴛ Rᴇsᴛᴀʀᴛᴇᴅ !

📅 Dᴀᴛᴇ : <code>{}</code>
⏰ Tɪᴍᴇ : <code>{}</code>
🌐 Tɪᴍᴇᴢᴏɴᴇ : <code>Asia/Kolkata</code>
🛠️ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: <code>v1.2.0 [ Sᴛᴀʙʟᴇ ]</code></b>"""

    LOGO = """

BOT WORKING PROPERLY"""
